app/views/users/index.html.erb

SELECT "departments".* FROM "departments" INNER JOIN "tenants" ON "departments"."id" = "tenants"."department_id" WHERE "tenants"."user_id" = ?  [["user_id", 6]]
---
      <%= user.departments.name %>
      <% user.departments.each do |g| %>