app/views/users/new.html.erb

SELECT "departments".* FROM "departments"
---
    <%= f.text_field :login_name %>
    <%= f.collection_check_boxes(:department_ids, Department.all, :id, :name) %>