app/views/users/show.html.erb

SELECT "departments".* FROM "departments" INNER JOIN "tenants" ON "departments"."id" = "tenants"."department_id" WHERE "tenants"."user_id" = ?  [["user_id", 5]]
---
<p>Group:
	<% @user.departments.each do |g| %>