app/controllers/departments_controller.rb

INSERT INTO "departments" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "d"], ["created_at", "2019-04-15 01:16:07.690935"], ["updated_at", "2019-04-15 01:16:07.690935"]]
---
def create
  @department = Department.new(de_params)

  @department.save