app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    @user.save
---
INSERT INTO "users" ("login_name", "created_at", "updated_at") VALUES (?, ?, ?)  [["login_name", "1"], ["created_at", "2019-04-15 00:26:16.532164"], ["updated_at", "2019-04-15 00:26:16.532164"]]

  def hascomment
    @user = User.find(params[:id])
    Comment.create(:owner => @user)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
INSERT INTO "comments" ("owner_type", "owner_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["owner_type", "User"], ["owner_id", 7], ["created_at", "2019-05-06 06:12:58.005682"], ["updated_at", "2019-05-06 06:12:58.005682"]]

  def hasnotcomment
    @user = User.find(params[:id])
    comment = @user.comments.first
    comment.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]